"""
需求:有一份账单文件，记录了消费收入的具体记录，内容如下:
name,date,money,type,remarks
周杰轮,2022-01-01,100000,消费,正式
周杰轮,2022-01-02,300000,收入,正式
周杰轮,2022-01-03,100000,消费,测试
林俊节,2022-01-01,300000,收入,正式
林俊节,2022-01-02,100000,消费,测试
林俊节,2022-01-03,100000,消费,正式
林俊节,2022-01-04,100000,消费,测试
林俊节,2022-01-05,500000,收入,正式
张学油,2022-01-01,100000,消费,正式
张学油,2022-01-02,500000,收入,正式
张学油,2022-01-03,900000,收入,测试
王力鸿,2022-01-01,500000,消费,正式
王力鸿,2022-01-02,300000,消费,测试
王力鸿,2022-01-03,950000,收入,正式
刘德滑,2022-01-01,300000,消费,测试
刘德滑,2022-01-02,100000,消费,正式
刘德滑,2022-01-03,300000,消费,正式
同学们可以将内容复制并保存为test_word4.txt文件
我们现在要做的就是:
读取文件
将文件写出到test_word4.txt.bak文件作为备份同时，将文件内标记为测试的
数据行丢弃
实现思路:
open和r模式打开一个文件对象，并读取文件open和w模式打开另一个文件对象，
用于文件写出for循环内容，判断是否是测试不是测试就write写出，
是测试就continue跳过将2个文件对象均close()
"""

fr = open("./python对于文件的应用/test_word4.txt","r",encoding="UTF-8")

fw = open("./python对于文件的应用/test_word4.txt.bak","w",encoding="UTF-8")
for line in fr:
    line = line.strip() # 消除符号换行符空格
    if line.split(",")[4] == "测试":     # split将字符以()分隔开
        continue
    fw.write(line)
    fw.write("\n")
    fr.close
    fw.close
